XYZUtils.OptXYZIn
OptXYZIn is a class that is intended to be used for optional XYZ input arguments.
NOTE that if the argument is not optional you should not use const OptXYZIn& , but
use const XYZ&  instead.
Remarks:
OptXYZIn is modeled on std::optional<T> , but with some differences.
Aside from the constructing from XYZ, OptXYZIn can also be created from nullptr and pointer types like Vec3d.
OptXYZIn also has XYZ specific accessors, including a cast to Vec3d.
These differences allow OptXYZIn to be used as a drop-in replacement for const Vec3d or const Vec3d&
arguments that are treated as optional inputs by the fuction.
For an example see Trf::setVectors()
NOTE that unlike std::optional<T> OptXYZIn only holds a pointer to the actual data.
It does not make a copy of the XYZ.  This means that the lifetime of a OptXYZIn
should not exceed the lifetime of the data (a Vec3 or and XYZ).
As a result OptXYZIn is not intended to be used as a return value.
Use the following syntax to test an OptionInXYZ :
void foo(const OptXYZIn& optXYZ)
{
if (optXYZ)  // or test explicitly with "optXYZ.has_value()"
{ // use the value
const XYZ& value = optXYZ.value();
}
}
or access the value through value_or :
void foo(const OptXYZIn& optXYZ)
{
XYZ defaultValue;
XYZ value = optXYZ.value_or(defaultValue);
}